{"symbol": "BRFS", "profile": {"price": 4.14, "beta": "1.101", "volAvg": "2967560", "mktCap": "6907313535", "lastDiv": "0", "range": "1.74-4.25", "changes": 0.07, "changesPercentage": "1.6908212560386475", "companyName": "BRF S.A.", "exchange": "New York Stock Exchange", "exchangeShortName": "NYSE", "industry": "Packaged Foods", "website": "https://www.brf-global.com", "description": "BRF S.A. focuses on raising, producing, and slaughtering poultry and pork for processing, production, and sale of fresh meat, processed products, pasta, margarine, and other products. The company's product portfolio comprises meat products, including frozen whole and cut chicken, frozen pork, and beef; processed food products, such as marinated, frozen, whole and cut chicken, roosters, turkey meat, sausages, ham products, bologna, frankfurters, salamis, bacon, cold meats, other smoked products, chicken sausages, chicken hot dogs, and chicken bologna; and frozen processed meats comprising hamburgers, steaks, breaded meat products, kibbeh, and meatballs. It also produces and sells frozen prepared entrees, such as pastas and pizzas, including lasagna, macaroni, sandwiches, cheese breads, and other ready-to-eat meals; pies and pastries comprising chicken and heart-of-palm pies, sauces, and toppings; frozen desserts; plant-based products, such as nuggets, pies, vegetables, and hamburgers; and soy meal, refined soy flour, and animal feed, as well as sell frozen French fries, margarine, butter, and cream cheese. The company primarily sells its products under the Sadia, Perdigão, Qualy, Chester, Kidelli, Perdix, Biofresh, Gran Plus, and Banvit brands. It serves supermarkets, wholesalers, retail stores, food services, restaurants, and other institutional buyers. The company is also involved in the provision of consultancy, marketing, and logistics services; commercialization of electric energy; and import, industrialization, and commercialization of products. BRF S.A. operates primarily in Brazil, the Americas, Europe, the Middle East, Africa, Asia, and internationally. The company was formerly known as BRF-Brasil Foods S.A. and changed its name to BRF S.A. in April 2013. BRF S.A. was founded in 1934 and is headquartered in Itajaí, Brazil.", "ceo": "Mr. Miguel  de Souza Gularte", "sector": "Consumer Defensive", "country": "BR", "fullTimeEmployees": "100000", "phone": null, "address": "Rua Jorge Tzachel, nº 475", "city": "Itajaí", "state": "SC", "zip": "04794-000", "ipoDate": "2000-10-20", "currency": "USD", "isin": "US10552T1079", "cusip": "10552T107", "cik": "0001122491", "image": "https://financialmodelingprep.com/image-stock/BRFS.png", "defaultImage": false, "isEtf": false, "isActivelyTrading": true, "isFund": false, "isAdr": true}}